(function() {
  const store = [
    {
      "id": 1,
      "url": "url1",
      "categories": [
        "Hot",
        "Coffee",
        "Beverage"
      ],
      "title": "卡布奇诺 book",
      "body": "卡布奇诺中的牛奶含量比拿铁少，所以它的浓缩咖啡味道更浓郁，而且口感也更醇厚。调制一杯完美的卡布奇诺是一种艺术，需要很多尝试和技巧。其中最重要的一步是在蒸牛奶时怎样把奶泡弄得像鹅绒般细滑，这是我们的咖啡师需要全神贯注的一步。你喝卡布奇诺时如果奶泡能够在你上唇化成一道“奶胡子”，那就证明我们的手艺到家了。请允许我们说，你的“奶胡子”留着挺漂亮的。"
    },
    {
      "id": 2,
      "url": "url2",
      "categories": [
        "Cold",
        "Tea",
        "Beverage"
      ],
      "title": "茶瓦纳™ 冰摇柚柚蜂蜜红茶章",
      "body": "混合了韩国柚子的清香、以色列柚汁的甘甜、美国粉柚汁的果香融于醇香红茶，颗颗饱满果粒和清甜柚子皮，点缀上洋槐蜂蜜层层深入的口感，让TA对这杯沁人心脾念念不忘 。"
    },
    {
      "id": 3,
      "url": "url3",
      "categories": [
        "Cole"
      ],
      "title": "黄金时代",
      "body": "那一天我二十一岁，在我一生的黄金时代，我有好多奢望。我想爱，想吃，还想在一瞬间变成天上半明半暗的云。后来我才知道，生活就是个缓慢受锤的过程，人一天天老下去，奢望也一天天消失，最后变得像挨了锤的牛一样。可是我过二十一岁生日时没有预见到这一点。我觉得自己会永远生猛下去，什么也锤不了我。"
    }
  ].reduce((pre, cur) => {
    pre[cur.url] = cur
    return pre
  }, {})

  function loadJSON(callback) {
    var xobj = new XMLHttpRequest();
    xobj.overrideMimeType("application/json");
    xobj.open('GET', '/assets/search/index-cn.json', true);
    xobj.onreadystatechange = function () {
      if (xobj.readyState == 4 && xobj.status == "200") {
        callback(xobj.responseText);
      }
    };
    xobj.send(null);
  }

  function displaySearchResults(results, store) {
    console.log('>> results', results, store);
    var searchResults = document.getElementById('search-results');

    if (results.length) { // Are there any results?
      var appendString = '';

      for (var i = 0; i < results.length; i++) {  // Iterate over the results
        var item = store[results[i].ref];
        appendString += '<li>';
        appendString += '  <a class="card" href="' + item.url + '">';
        appendString += '    <h3>' + item.title + '</h3>';
        appendString += '  </a>';
        appendString += '</li>';
      }

      searchResults.innerHTML = appendString;
    } else {
      searchResults.innerHTML = '<li><h3 class="empty"> Empty </h3></li>';
    }
  }

  function getQueryVariable(variable) {
    var query = window.location.search.substring(1);
    var vars = query.split('&');

    for (var i = 0; i < vars.length; i++) {
      var pair = vars[i].split('=');

      if (pair[0] === variable) {
        return decodeURIComponent(pair[1].replace(/\+/g, '%20'));
      }
    }
  }

  function initSearch(lunr) {
    document.getElementById('search-input').addEventListener('keyup', function () {
      console.log('>>> value', this.value);
      if (this.value) {
        var results = lunr.search(this.value); // Get lunr to perform a search
        displaySearchResults(results, store); // We'll write this in the next section
      }
      else {
        document.getElementById('search-results').innerHTML = '';
      }
    });
  }

  // loadJSON(function (response) {
    // var tokenizedSearchIndex = JSON.parse(response);
    // var chineseLunr = lunr.Index.load(tokenizedSearchIndex);
    // chineseLunr.search('星')
    // initSearch(chineseLunr);
  // });

  const afterLoad = () => {
    var tokenizedSearchIndex = {"version":"0.7.2","fields":[{"name":"title","boost":10},{"name":"categories","boost":1},{"name":"body","boost":1}],"ref":"url","tokenizer":"default","documentStore":{"store":{"url1":["beverag","book","coffe","hot","“","”","。","一杯","一步","一种","一道","上唇","中","也","了","你","你的","像","允许","全神贯注","其中","到家","化成","卡布奇诺","口感","含量","味道","和","咖啡","咖啡师","喝","在","奶","奶泡","如果","它","完美","尝试","就","弄","很多","得","怎样","我们","所以","手艺","技巧","把","挺","时","是","更","最","比拿铁少","浓缩","浓郁","漂亮","牛奶","留","的","着","而且","胡子","能够","般细滑","艺术","蒸","证明","说","请","调制","这是","那","醇厚","重要","需要","鹅绒","，"],"url2":["beverag","cold","ta","tea","™","、","。","上","了","以色列","冰摇柚","口感","和","对","层层","念念不忘","果粒","果香","柚","柚子","柚汁","沁人心脾","洋槐","深入","混合","清甜","清香","点缀","甘甜","的","皮","章","粉柚汁","红茶","美国","茶瓦纳","蜂蜜","融于","让","这杯","醇香","韩国","颗颗","饱满","，"],"url3":["cole","。","一天","一天天","一样","一点","一生","一瞬间","下去","不了","个","也","了","二十一岁","云","人","什么","会","像","半明半暗","受锤","变得","变成","可是","吃","后来","在","天上","奢望","好多","就是","想","我","我过","才","挨","时","最后","有","永远","没有","消失","爱","牛","生日","生活","生猛","的","知道","缓慢","老","自己","觉得","过程","还","这","那","锤","预见到","黄金时代","，"]},"length":3},"tokenStore":{"root":{"docs":{},"b":{"docs":{},"e":{"docs":{},"v":{"docs":{},"e":{"docs":{},"r":{"docs":{},"a":{"docs":{},"g":{"docs":{"url1":{"ref":"url1","tf":0.3333333333333333},"url2":{"ref":"url2","tf":0.3333333333333333}}}}}}}},"o":{"docs":{},"o":{"docs":{},"k":{"docs":{"url1":{"ref":"url1","tf":5}}}}}},"c":{"docs":{},"o":{"docs":{},"f":{"docs":{},"f":{"docs":{},"e":{"docs":{"url1":{"ref":"url1","tf":0.3333333333333333}}}}},"l":{"docs":{},"d":{"docs":{"url2":{"ref":"url2","tf":0.3333333333333333}}},"e":{"docs":{"url3":{"ref":"url3","tf":1}}}}}},"h":{"docs":{},"o":{"docs":{},"t":{"docs":{"url1":{"ref":"url1","tf":0.3333333333333333}}}}},"“":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}}},"”":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}}},"。":{"docs":{"url1":{"ref":"url1","tf":0.04672897196261682},"url2":{"ref":"url2","tf":0.022727272727272728},"url3":{"ref":"url3","tf":0.05555555555555555}}},"一":{"docs":{},"杯":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"步":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}}},"种":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"道":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"天":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}},"天":{"docs":{"url3":{"ref":"url3","tf":0.022222222222222223}}}},"样":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"点":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"生":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"瞬":{"docs":{},"间":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}}},"上":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}},"唇":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"中":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"也":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364},"url3":{"ref":"url3","tf":0.022222222222222223}}},"了":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364},"url2":{"ref":"url2","tf":0.022727272727272728},"url3":{"ref":"url3","tf":0.011111111111111112}}},"你":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}},"的":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"像":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364},"url3":{"ref":"url3","tf":0.011111111111111112}}},"允":{"docs":{},"许":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"全":{"docs":{},"神":{"docs":{},"贯":{"docs":{},"注":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}}}},"其":{"docs":{},"中":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"到":{"docs":{},"家":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"化":{"docs":{},"成":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"卡":{"docs":{},"布":{"docs":{},"奇":{"docs":{},"诺":{"docs":{"url1":{"ref":"url1","tf":5.02803738317757}}}}}},"口":{"docs":{},"感":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364},"url2":{"ref":"url2","tf":0.022727272727272728}}}},"含":{"docs":{},"量":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"味":{"docs":{},"道":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"和":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364},"url2":{"ref":"url2","tf":0.022727272727272728}}},"咖":{"docs":{},"啡":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}},"师":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}}},"喝":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"在":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728},"url3":{"ref":"url3","tf":0.022222222222222223}}},"奶":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}},"泡":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}}}},"如":{"docs":{},"果":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"它":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"完":{"docs":{},"美":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"尝":{"docs":{},"试":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"就":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}},"是":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"弄":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"很":{"docs":{},"多":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"得":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"怎":{"docs":{},"样":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"我":{"docs":{"url3":{"ref":"url3","tf":0.07777777777777778}},"们":{"docs":{"url1":{"ref":"url1","tf":0.028037383177570093}}},"过":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"所":{"docs":{},"以":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"手":{"docs":{},"艺":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"技":{"docs":{},"巧":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"把":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"挺":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"时":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728},"url3":{"ref":"url3","tf":0.011111111111111112}}},"是":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}}},"更":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}}},"最":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}},"后":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"比":{"docs":{},"拿":{"docs":{},"铁":{"docs":{},"少":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}}}},"浓":{"docs":{},"缩":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"郁":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"漂":{"docs":{},"亮":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"牛":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}},"奶":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}}}},"留":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"的":{"docs":{"url1":{"ref":"url1","tf":0.07476635514018691},"url2":{"ref":"url2","tf":0.09090909090909091},"url3":{"ref":"url3","tf":0.044444444444444446}}},"着":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"而":{"docs":{},"且":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"胡":{"docs":{},"子":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}}}},"能":{"docs":{},"够":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"般":{"docs":{},"细":{"docs":{},"滑":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}}},"艺":{"docs":{},"术":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"蒸":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"证":{"docs":{},"明":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"说":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"请":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"调":{"docs":{},"制":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"这":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}},"是":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"杯":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"那":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364},"url3":{"ref":"url3","tf":0.011111111111111112}}},"醇":{"docs":{},"厚":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}},"香":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"重":{"docs":{},"要":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"需":{"docs":{},"要":{"docs":{"url1":{"ref":"url1","tf":0.018691588785046728}}}},"鹅":{"docs":{},"绒":{"docs":{"url1":{"ref":"url1","tf":0.009345794392523364}}}},"，":{"docs":{"url1":{"ref":"url1","tf":0.056074766355140186},"url2":{"ref":"url2","tf":0.06818181818181818},"url3":{"ref":"url3","tf":0.1}}},"t":{"docs":{},"a":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}},"e":{"docs":{},"a":{"docs":{"url2":{"ref":"url2","tf":0.3333333333333333}}}}},"™":{"docs":{"url2":{"ref":"url2","tf":1.4285714285714284}}},"、":{"docs":{"url2":{"ref":"url2","tf":0.045454545454545456}}},"以":{"docs":{},"色":{"docs":{},"列":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}}},"冰":{"docs":{},"摇":{"docs":{},"柚":{"docs":{"url2":{"ref":"url2","tf":1.4285714285714284}}}}},"对":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}},"层":{"docs":{},"层":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"念":{"docs":{},"念":{"docs":{},"不":{"docs":{},"忘":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}}}},"果":{"docs":{},"粒":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}},"香":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"柚":{"docs":{"url2":{"ref":"url2","tf":1.4285714285714284}},"子":{"docs":{"url2":{"ref":"url2","tf":0.045454545454545456}}},"汁":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"沁":{"docs":{},"人":{"docs":{},"心":{"docs":{},"脾":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}}}},"洋":{"docs":{},"槐":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"深":{"docs":{},"入":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"混":{"docs":{},"合":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"清":{"docs":{},"甜":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}},"香":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"点":{"docs":{},"缀":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"甘":{"docs":{},"甜":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"皮":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}},"章":{"docs":{"url2":{"ref":"url2","tf":1.4285714285714284}}},"粉":{"docs":{},"柚":{"docs":{},"汁":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}}},"红":{"docs":{},"茶":{"docs":{"url2":{"ref":"url2","tf":1.451298701298701}}}},"美":{"docs":{},"国":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"茶":{"docs":{},"瓦":{"docs":{},"纳":{"docs":{"url2":{"ref":"url2","tf":1.4285714285714284}}}}},"蜂":{"docs":{},"蜜":{"docs":{"url2":{"ref":"url2","tf":1.451298701298701}}}},"融":{"docs":{},"于":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"让":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}},"韩":{"docs":{},"国":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"颗":{"docs":{},"颗":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"饱":{"docs":{},"满":{"docs":{"url2":{"ref":"url2","tf":0.022727272727272728}}}},"下":{"docs":{},"去":{"docs":{"url3":{"ref":"url3","tf":0.022222222222222223}}}},"不":{"docs":{},"了":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"个":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"二":{"docs":{},"十":{"docs":{},"一":{"docs":{},"岁":{"docs":{"url3":{"ref":"url3","tf":0.022222222222222223}}}}}},"云":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"人":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"什":{"docs":{},"么":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"会":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"半":{"docs":{},"明":{"docs":{},"半":{"docs":{},"暗":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}}}},"受":{"docs":{},"锤":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"变":{"docs":{},"得":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"成":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"可":{"docs":{},"是":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"吃":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"后":{"docs":{},"来":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"天":{"docs":{},"上":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"奢":{"docs":{},"望":{"docs":{"url3":{"ref":"url3","tf":0.022222222222222223}}}},"好":{"docs":{},"多":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"想":{"docs":{"url3":{"ref":"url3","tf":0.03333333333333333}}},"才":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"挨":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"有":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"永":{"docs":{},"远":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"没":{"docs":{},"有":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"消":{"docs":{},"失":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"爱":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"生":{"docs":{},"日":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"活":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"猛":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"知":{"docs":{},"道":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"缓":{"docs":{},"慢":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"老":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"自":{"docs":{},"己":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"觉":{"docs":{},"得":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"过":{"docs":{},"程":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}},"还":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}},"锤":{"docs":{"url3":{"ref":"url3","tf":0.022222222222222223}}},"预":{"docs":{},"见":{"docs":{},"到":{"docs":{"url3":{"ref":"url3","tf":0.011111111111111112}}}}},"黄":{"docs":{},"金":{"docs":{},"时":{"docs":{},"代":{"docs":{"url3":{"ref":"url3","tf":10.011111111111111}}}}}}},"length":552},"corpusTokens":["beverag","book","coffe","cold","cole","hot","ta","tea","“","”","™","、","。","一天","一天天","一杯","一样","一步","一点","一生","一瞬间","一种","一道","上","上唇","下去","不了","个","中","也","了","二十一岁","云","人","什么","以色列","会","你","你的","像","允许","全神贯注","其中","冰摇柚","到家","化成","半明半暗","卡布奇诺","受锤","变得","变成","口感","可是","吃","后来","含量","味道","和","咖啡","咖啡师","喝","在","天上","奢望","奶","奶泡","好多","如果","它","完美","对","尝试","就","就是","层层","弄","很多","得","念念不忘","怎样","想","我","我们","我过","所以","手艺","才","技巧","把","挨","挺","时","是","更","最","最后","有","果粒","果香","柚","柚子","柚汁","比拿铁少","永远","沁人心脾","没有","洋槐","浓缩","浓郁","消失","深入","混合","清甜","清香","漂亮","点缀","爱","牛","牛奶","甘甜","生日","生活","生猛","留","的","皮","着","知道","章","粉柚汁","红茶","缓慢","美国","老","而且","胡子","能够","自己","般细滑","艺术","茶瓦纳","蒸","蜂蜜","融于","觉得","让","证明","说","请","调制","过程","还","这","这是","这杯","那","醇厚","醇香","重要","锤","需要","韩国","预见到","颗颗","饱满","鹅绒","黄金时代","，"],"pipeline":["trimmer","stopWordFilter","stemmer"]}

    var chineseLunr = lunr.Index.load(tokenizedSearchIndex);

    console.log('>>> lunr', chineseLunr);
    chineseLunr.search('星')
    initSearch(chineseLunr);
  }

  afterLoad()
})();
